#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_kms_key.example: Refreshing state... [id=13b0f9cd-df28-4062-b716-02627310c63f]
aws_cloudwatch_event_rule.example_batch: Refreshing state... [id=example-batch]
aws_cloudwatch_log_group.for_ecs: Refreshing state... [id=/ecs/example]
aws_ssm_parameter.db_password: Refreshing state... [id=/db/password]
aws_s3_bucket.frontend: Refreshing state... [id=mmdev-test-frontend]
aws_cloudwatch_log_group.for_ecs_scheduled_tasks: Refreshing state... [id=/ecs-scheduled-tasks/example]
aws_s3_bucket.alb_log: Refreshing state... [id=mmdev-test-alb-log]
aws_ecs_cluster.example: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:138767642386:cluster/example]
aws_vpc.example: Refreshing state... [id=vpc-0c45618c04ecd68e9]
aws_s3_bucket.records: Refreshing state... [id=mmdev-test-records]
aws_ssm_parameter.db_username: Refreshing state... [id=/db/username]
module.ecs_task_execution_role.aws_iam_role.default: Refreshing state... [id=ecs-task-execution]
module.ecs_events_role.aws_iam_role.default: Refreshing state... [id=ecs-events]
module.ecs_events_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::138767642386:policy/ecs-events]
aws_ecs_task_definition.example: Refreshing state... [id=example]
aws_ecs_task_definition.example_batch: Refreshing state... [id=example-batch]
module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::138767642386:policy/ecs-task-execution]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20220210083936009300000003]
module.ecs_events_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-events-20220210083936173900000004]
aws_kms_alias.example: Refreshing state... [id=alias/example]
aws_subnet.private_1: Refreshing state... [id=subnet-05a660cd3824a80e9]
module.http_redirect_sg.aws_security_group.default: Refreshing state... [id=sg-01964ac4f871a34ac]
aws_route_table.public: Refreshing state... [id=rtb-010cba2e60d2959e7]
aws_subnet.private_0: Refreshing state... [id=subnet-0ee8f9f99eac2550a]
aws_subnet.public_0: Refreshing state... [id=subnet-076ab3dd915e57e57]
aws_route_table.private_1: Refreshing state... [id=rtb-04e27e2d7acfe3d4a]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-093403f5500e9c1ec]
aws_route_table.private_0: Refreshing state... [id=rtb-01412ea24871678f5]
aws_internet_gateway.example: Refreshing state... [id=igw-069441f5cb619ea69]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-0c465631ff9e793bc]
aws_subnet.public_1: Refreshing state... [id=subnet-003f29626031d9778]
module.nginx_sg.aws_security_group.default: Refreshing state... [id=sg-0366ee34184bc0203]
aws_cloudwatch_event_target.example_batch: Refreshing state... [id=example-batch-example_batch]
aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-09317c783aa616d9f]
aws_route_table_association.public_0: Refreshing state... [id=rtbassoc-028ed19de90f5defc]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-192988030]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2381239696]
module.http_redirect_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2132300289]
module.http_redirect_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3326122449]
aws_route_table_association.private_0: Refreshing state... [id=rtbassoc-0f82389c69ebabb6f]
aws_eip.nat_gateway_0: Refreshing state... [id=eipalloc-038f6c788d40fc696]
aws_route.public: Refreshing state... [id=r-rtb-010cba2e60d2959e71080289494]
aws_eip.nat_gateway_1: Refreshing state... [id=eipalloc-0c884f575ef9d04c5]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3915472204]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4050970949]
aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-00920775622dba392]
module.nginx_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-789012877]
module.nginx_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1092241654]
aws_security_group_rule.egress-fargate: Refreshing state... [id=sgrule-1145183076]
aws_nat_gateway.example_0: Refreshing state... [id=nat-0d0352e6cbc675a55]
aws_nat_gateway.example_1: Refreshing state... [id=nat-0e7bd968ecc9bcae0]
aws_route.private_1: Refreshing state... [id=r-rtb-04e27e2d7acfe3d4a1080289494]
aws_route.private_0: Refreshing state... [id=r-rtb-01412ea24871678f51080289494]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/a518c90f77141fb2]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=mmdev-test-alb-log]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener/app/example/a518c90f77141fb2/5903f5c354cc4540]
aws_route53_record.example: Refreshing state... [id=Z01452181Y0V7XT1HWID4_mmdev110.tk_A]
aws_lb_listener.redirect_http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener/app/example/a518c90f77141fb2/9860be4e09902f40]
aws_lb_target_group.example: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:targetgroup/example/80b53fcea2e98fb0]
aws_acm_certificate.example: Refreshing state... [id=arn:aws:acm:ap-northeast-1:138767642386:certificate/a24d95c5-4a7a-40bc-af3e-9fa910130f43]
aws_route53_record.example_certificate: Refreshing state... [id=Z01452181Y0V7XT1HWID4__7e361a9aa09c6a31896a7715a896ca0a.mmdev110.tk._CNAME]
aws_ecs_service.example: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:138767642386:service/example/example]
aws_acm_certificate_validation.example: Refreshing state... [id=2022-02-10 08:43:43.052 +0000 UTC]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener/app/example/a518c90f77141fb2/26fc512924dd1994]
aws_lb_listener_rule.example: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:listener-rule/app/example/a518c90f77141fb2/26fc512924dd1994/c58c841761f3a71f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudwatch_event_target.example_batch has changed
  ~ resource "aws_cloudwatch_event_target" "example_batch" {
        id             = "example-batch-example_batch"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          - launch_type             = "FARGATE" -> null
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ap-northeast-1:138767642386:task-definition/example-batch:1" -> "arn:aws:ecs:ap-northeast-1:138767642386:task-definition/example-batch"
            # (4 unchanged attributes hidden)

          - network_configuration {
              - assign_public_ip = false -> null
              - security_groups  = [] -> null
              - subnets          = [
                  - "subnet-0ee8f9f99eac2550a",
                ] -> null
            }
        }
    }

  # aws_ecs_task_definition.example has changed
  ~ resource "aws_ecs_task_definition" "example" {
        id                       = "example"
      + tags                     = {}
        # (11 unchanged attributes hidden)
    }

  # aws_kms_key.example has changed
  ~ resource "aws_kms_key" "example" {
        id                                 = "13b0f9cd-df28-4062-b716-02627310c63f"
      + tags                               = {}
        # (12 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_password has changed
  ~ resource "aws_ssm_parameter" "db_password" {
        id          = "/db/password"
        name        = "/db/password"
      + tags        = {}
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_username has changed
  ~ resource "aws_ssm_parameter" "db_username" {
        id          = "/db/username"
        name        = "/db/username"
      + tags        = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.example_batch will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "example_batch" {
        id             = "example-batch-example_batch"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          + launch_type             = "FARGATE"
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:ap-northeast-1:138767642386:task-definition/example-batch" -> "arn:aws:ecs:ap-northeast-1:138767642386:task-definition/example-batch:1"
            # (4 unchanged attributes hidden)

          + network_configuration {
              + assign_public_ip = false
              + subnets          = [
                  + "subnet-0ee8f9f99eac2550a",
                ]
            }
        }
    }

  # aws_db_instance.example will be created
  + resource "aws_db_instance" "example" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 30
      + backup_window                         = "09:10-09:40"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "example"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7.25"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "example"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = "arn:aws:kms:ap-northeast-1:138767642386:key/13b0f9cd-df28-4062-b716-02627310c63f"
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:10:10-mon:10:40"
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = "example"
      + parameter_group_name                  = "example"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_option_group.example will be created
  + resource "aws_db_option_group" "example" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "5.7"
      + name                     = "example"
      + name_prefix              = (known after apply)
      + option_group_description = "Managed by Terraform"
      + tags_all                 = (known after apply)

      + option {
          + db_security_group_memberships  = []
          + option_name                    = "MARIADB_AUDIT_PLUGIN"
          + vpc_security_group_memberships = []
        }
    }

  # aws_db_parameter_group.example will be created
  + resource "aws_db_parameter_group" "example" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "mysql5.7"
      + id          = (known after apply)
      + name        = "example"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_database"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
    }

  # aws_db_subnet_group.example will be created
  + resource "aws_db_subnet_group" "example" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "example"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-05a660cd3824a80e9",
          + "subnet-0ee8f9f99eac2550a",
        ]
      + tags_all    = (known after apply)
    }

  # aws_elasticache_parameter_group.example will be created
  + resource "aws_elasticache_parameter_group" "example" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis5.0"
      + id          = (known after apply)
      + name        = "example"
      + tags_all    = (known after apply)

      + parameter {
          + name  = "cluster-enabled"
          + value = "no"
        }
    }

  # aws_elasticache_replication_group.example will be created
  + resource "aws_elasticache_replication_group" "example" {
      + apply_immediately              = false
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "5.0.4"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "mon:10:40-mon:11:40"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.m3.medium"
      + number_cache_clusters          = 3
      + parameter_group_name           = "example"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replication_group_description  = "Cluster Disabled"
      + replication_group_id           = "example"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 7
      + snapshot_window                = "09:10-10:10"
      + subnet_group_name              = "example"
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

  # aws_elasticache_subnet_group.example will be created
  + resource "aws_elasticache_subnet_group" "example" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "example"
      + subnet_ids  = [
          + "subnet-05a660cd3824a80e9",
          + "subnet-0ee8f9f99eac2550a",
        ]
      + tags_all    = (known after apply)
    }

  # aws_ssm_parameter.db_raw_password will be created
  + resource "aws_ssm_parameter" "db_raw_password" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "データベースのパスワード"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/db/raw_password"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.mysql_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "mysql-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0c45618c04ecd68e9"
    }

  # module.mysql_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.mysql_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.redis_sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0c45618c04ecd68e9"
    }

  # module.redis_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.redis_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

Plan: 14 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @mmdev110, Action: `pull_request`*